
# tap repositories and their packages

tap 'homebrew/core'
brew 'autoconf'
brew 'docker'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'gradle'
brew 'icu4c'
brew 'jenv'
brew 'libtool'
brew 'mas'
brew 'ncurses'
brew 'nodebrew'
brew 'openssl'
brew 'pcre'
brew 'pcre2'
brew 'pkg-config'
brew 'postgresql'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'readline'
brew 'ruby-build'
brew 'unixodbc'
brew 'zsh'

tap 'homebrew/bundle'

tap 'homebrew/cask-versions'
cask 'sequel-pro-nightly'

tap 'homebrew/cask'
<<<<<<< HEAD
cask 'amazon-music'
cask 'azure-data-studio'
cask 'chromedriver'
cask 'docker'
cask 'evernote'
cask 'iterm2'
cask 'shiftit'
cask 'springtoolsuite'
cask 'xmind'

tap 'caskroom/cask'
cask 'astah-professional'
cask 'db-browser-for-sqlite'
cask 'google-chrome'
cask 'slack'
=======
cask 'astah-professional'
cask 'chromedriver'
cask 'docker'
cask 'evernote'
cask 'slack'
cask 'xmind'

tap 'caskroom/cask'
cask 'background-music'
cask 'drawio'
cask 'visual-studio-code'
>>>>>>> develop

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'FreeTDS'
brew 'Nginx'

# Other Cask applications
<<<<<<< HEAD
cask 'HyperSwitch'
cask 'Notable'
cask 'background-music'
cask 'drawio'
cask 'postman'
cask 'visual-studio-code'
=======
cask 'db-browser-for-sqlite'
cask 'google-chrome'
>>>>>>> develop

# App Store applications
mas 'com.apple.dt.Xcode', id: id:
mas 'jp.naver.line.mac', id: id:
